app/controllers/planes_controller.rb

  def create
    @plane = Plane.new(plane_params)

    respond_to do |format|
      if @plane.save
---
INSERT INTO "planes" ("ac_reg", "ac_typ", "body", "created_at", "group", "note", "operator", "ph_out", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @plane.update(plane_params)
---
UPDATE "planes" SET "ac_reg" = ?, "updated_at" = ? WHERE "planes"."id" = 1  [["ac_reg", "IMG"], ["updated_at", Sun, 02 Mar 2014 14:25:43 UTC +00:00]]

    def set_plane
      @plane = Plane.find(params[:id])
---
SELECT "planes".* FROM "planes" WHERE "planes"."id" = ? LIMIT 1  [["id", "1"]]