app/controllers/posts_controller.rb

  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("ac_reg", "author", "created_at", "critical", "date", "open", "private", "shift", "station", "text", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)