app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "email", "encrypted_password", "first_name", "last_name", "role", "updated_at", "username") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save

UPDATE "users" SET "username" = ?, "first_name" = ?, "last_name" = ?, "role" = ?, "updated_at" = ? WHERE "users"."id" = 1  [["username", "ca040170"], ["first_name", "Luigi"], ["last_name", "Careddu"], ["role", "admin"], ["updated_at", Mon, 03 Mar 2014 21:17:09 UTC +00:00]]
---
  def update
    respond_to do |format|
      if params[:user][:password].blank?
		  params[:user].delete(:password)
		  params[:user].delete(:password_confirmation)
	  end

      if @user.update(user_params)